_posts/2017-04-16-A-callable-plist-data-structure-for-Emacs.html
---
title: A callable plist data structure for Emacs
date: 2017/04/16 16:44:53
updated: 2018/02/04 17:06:08
categories: emacs,macro,elisp
tags: 
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb831a3d">1. An update <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-04-21 Fri&gt;</span></span></a></li>
</ul>
</div>
</div>
<p>
Emacs lisp has a few data structures that store key-value pairs. Here are some canonical examples of these data structures and the way to get data out of them.
</p>

<ul class="org-ul">
<li>a-lists</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">let</span> ((data '((key1 . 4)
              (key2 . <span style="color: #008000;">"tree"</span>))))
  (cdr (assoc 'key2 data)))
</pre>
</div>

<pre class="example">
tree

</pre>

<ul class="org-ul">
<li>p-lists</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">let</span> ((data '(<span style="color: #006FE0;">:key1</span> 4 <span style="color: #006FE0;">:key2</span> <span style="color: #008000;">"tree"</span>)))
  (plist-get data <span style="color: #006FE0;">:key2</span>))
</pre>
</div>

<pre class="example">
tree

</pre>

<ul class="org-ul">
<li>A hash table</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">let</span> ((data #s(hash-table data (key1 4 key2 <span style="color: #008000;">"tree"</span>))))
  (gethash 'key2 data))
</pre>
</div>

<pre class="example">
tree

</pre>

<p>
Each of these uses some function to get data out of them. I have been learning about closures today, and realized a way you can make a "callable" data structure using them. In a closure, the data is stored as part of a function. We will use a <a href="http://letoverlambda.com">"let over lambda"</a> with a defalias in a lexical environment to achieve this. I will wrap a p-list with this approach, but it could work with any of the examples above. We will make the function have a few behaviors that allow us to see the whole data structure with no args, to get a value with one arg that is a key, and to set a value if there are more than two args add them as key-val pairs to the data structure. This block binds the function to the symbol "d" which is then a callable function.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">let</span> ((data '(<span style="color: #006FE0;">:key1</span> 4 <span style="color: #006FE0;">:key2</span> <span style="color: #008000;">"tree"</span>)))
  (<span style="color: #0000FF;">defalias</span> '<span style="color: #006699;">d</span>
    (<span style="color: #0000FF;">lambda</span> (<span style="color: #6434A3;">&amp;rest</span> key-vals)
      (<span style="color: #0000FF;">cond</span>
       <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">no args, return data</span>
       ((= 0 (length key-vals))
        data)
       <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">just a key, get val</span>
       ((= 1 (length key-vals))
        (plist-get data (car key-vals)))
       (t
        (<span style="color: #0000FF;">loop</span> for key in (-slice key-vals 0 nil 2)
              for val in (-slice key-vals 1 nil 2)
              do
              (plist-put data key val))
        data)))))
</pre>
</div>

<pre class="example">
d

</pre>

<p>
Now we can use it like to get some data out:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(d <span style="color: #006FE0;">:key2</span>)
</pre>
</div>

<pre class="example">
tree

</pre>

<p>
And add new values like:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(d <span style="color: #006FE0;">:key3</span> <span style="color: #008000;">"oak"</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">:key1</td>
<td class="org-right">4</td>
<td class="org-left">:key2</td>
<td class="org-left">tree</td>
<td class="org-left">:key3</td>
<td class="org-left">oak</td>
</tr>
</tbody>
</table>

<p>
You can update a value with this too:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(d <span style="color: #006FE0;">:key3</span> <span style="color: #008000;">"pine"</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">:key1</td>
<td class="org-right">4</td>
<td class="org-left">:key2</td>
<td class="org-left">tree</td>
<td class="org-left">:key3</td>
<td class="org-left">pine</td>
</tr>
</tbody>
</table>

<p>
or add multiple values like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(d <span style="color: #006FE0;">:key4</span> 0 <span style="color: #006FE0;">:key5</span> 9)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">:key1</td>
<td class="org-right">4</td>
<td class="org-left">:key2</td>
<td class="org-left">tree</td>
<td class="org-left">:key3</td>
<td class="org-left">pine</td>
<td class="org-left">:key4</td>
<td class="org-right">0</td>
<td class="org-left">:key5</td>
<td class="org-right">9</td>
</tr>
</tbody>
</table>

<p>
And see the whole plist with no args:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(d)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">:key1</td>
<td class="org-right">4</td>
<td class="org-left">:key2</td>
<td class="org-left">tree</td>
<td class="org-left">:key3</td>
<td class="org-left">pine</td>
<td class="org-left">:key4</td>
<td class="org-right">0</td>
<td class="org-left">:key5</td>
<td class="org-right">9</td>
</tr>
</tbody>
</table>

<p>
Pretty nice! It seems like there ought to be a macro to facilitate creating those. Here is one.
This macro basically expands to the same code as above, but for fun I add a default value option.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">default-dict</span> (var <span style="color: #6434A3;">&amp;optional</span> default <span style="color: #6434A3;">&amp;rest</span> key-vals)
  <span style="color: #036A07;">"Bind a callable plist to VAR that contains KEY-VALS."</span>
  (<span style="color: #0000FF;">let</span> ()
    `<span style="color: #D0372D;">(let ((data </span>',key-vals))
       (<span style="color: #0000FF;">defalias</span> ',var
         (<span style="color: #0000FF;">lambda</span> (<span style="color: #6434A3;">&amp;rest</span> key-vals)
           (message <span style="color: #008000;">"%s"</span> key-vals)
           (<span style="color: #0000FF;">cond</span>
            <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">no args, return data</span>
            ((= 0 (length key-vals))
             data)
            <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">just a key, get val</span>
            ((= 1 (length key-vals))
             (<span style="color: #0000FF;">or</span>  (plist-get data (car key-vals)) ,default))
            (t
             (<span style="color: #0000FF;">loop</span> for key in (-slice key-vals 0 nil 2)
                   for val in (-slice key-vals 1 nil 2)
                   do
                   (plist-put data key val))
             data)))))))
</pre>
</div>

<p>
Here is an instance of it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(default-dict d2 <span style="color: #008000;">"None"</span> <span style="color: #006FE0;">:key1</span> 4 <span style="color: #006FE0;">:key2</span> <span style="color: #008000;">"tree"</span>)
</pre>
</div>

<pre class="example">
d2

</pre>

<p>
And here it is in use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(d2 <span style="color: #006FE0;">:key1</span>)
</pre>
</div>

<pre class="example">
4

</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(d2 <span style="color: #006FE0;">:new-key</span>)
</pre>
</div>

<pre class="example">
None

</pre>

<p>
Not bad. If you come from Python, you might find this style of data structure to be more similar to what you are used to seeing. It sure seems less verbose than the usual plist boilerplate I have used before.
</p>

<div id="outline-container-orgb831a3d" class="outline-2">
<h2 id="orgb831a3d"><span class="section-number-2">1</span> An update <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-04-21 Fri&gt;</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
One (perhaps undesirable even) feature of the approach above is that it creates a function in the global namespace. This might have unintended consequences with name clashes or shadowing, and if you later use the same variable name for a plist, you would change the function behavior. Here we consider a way to limit the scope of where these functions exist and work. The labels macro provides one way to do this, we just create temporary functions that only exist within a scope. There is a lot of backticking and comma operators in this, and it took quite a few iterations to get it working!
</p>

<p>
This macro creates temporary functions for each keyword that return the value in the plist.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">with-dict</span> (key-vals <span style="color: #6434A3;">&amp;rest</span> body)
  <span style="color: #036A07;">"A context-manager for a plist where each key is a callable</span>
<span style="color: #036A07;">function that returns the value."</span>
  (<span style="color: #0000FF;">declare</span> (indent 1))
  (<span style="color: #0000FF;">let*</span> ((g (<span style="color: #0000FF;">if</span> (symbolp key-vals)
                (symbol-value key-vals)
              key-vals))
         (keys (-slice g 0 nil 2)))
    `(<span style="color: #0000FF;">labels</span> ,(<span style="color: #0000FF;">loop</span> for key in keys
                    collect
                    (list key '() `<span style="color: #D0372D;">(plist-get </span>',g  ,key)))
       ,@body)))
</pre>
</div>

<pre class="example">
with-dict

</pre>

<p>
Here is how we use it:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-dict (<span style="color: #006FE0;">:a</span> 1 <span style="color: #006FE0;">:b</span> 'some-symbol <span style="color: #006FE0;">:c</span> 3)
  (<span style="color: #006FE0;">:b</span>))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">quote</td>
<td class="org-left">some-symbol</td>
</tr>
</tbody>
</table>

<p>
We can also use it with variables that hold mappings like this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">let</span> ((d '(<span style="color: #006FE0;">:key1</span> 1 <span style="color: #006FE0;">:key2</span> some-other-symbol <span style="color: #006FE0;">:key3</span> 3)))
  (with-dict d
    (format <span style="color: #008000;">"We got %s"</span> (<span style="color: #006FE0;">:key2</span>))))
</pre>
</div>

<pre class="example">
We got some-other-symbol

</pre>

<p>
That is pretty interesting! In case that looks similar to a context manager in Python, now you know where Python got that idea ;)
</p>

<p>
Another related idea is to let-bind the values to variables within a scope. We can't use the keywords directly here, so I use some hackery to strip off the colon so it is a regular symbol. That is not quite as nice I guess since you have to remember to remove the : from the symbols in the body of your code.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">with-plist-vals</span> (plist <span style="color: #6434A3;">&amp;rest</span> body)
  <span style="color: #036A07;">"Bind the values of a plist to variables with the name of the keys."</span>
  (<span style="color: #0000FF;">declare</span> (indent 1))
  `(<span style="color: #0000FF;">let</span> ,(<span style="color: #0000FF;">loop</span> for key in (-slice plist 0 nil 2)
               for val in (-slice plist 1 nil 2)
               collect (list (intern
                              (substring (symbol-name key) 1))
                             val))
     ,@body))
</pre>
</div>

<pre class="example">
with-plist-vals

</pre>

<p>
Here is an example usage.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(with-plist-vals (<span style="color: #006FE0;">:a</span> 4 <span style="color: #006FE0;">:b</span> 6)
 (* 2 a))
</pre>
</div>

<pre class="example">
8

</pre>

<p>
Obviously that is just an alternate syntax for the let statement, but it lets you leverage the plist syntax for multiple purposes.</p>
</div>
</div>
<p>Copyright (C) 2018 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2017/04/16/A-callable-plist-data-structure-for-Emacs.org">org-mode source</a></p>
<p>Org-mode version = 9.1.6</p>